In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [43]:
titanic = sns.load_dataset("titanic")
titanic
t1 = titanic
t2 = titanic
ks = sns.load_dataset("titanic")

In [3]:
#simple math operation
(titanic["age"]+12)

0      34.0
1      50.0
2      38.0
3      47.0
4      47.0
       ...
886    39.0
887    31.0
888     NaN
889    38.0
890    44.0
Name: age, Length: 891, dtype: float64

In [4]:
titanic.shape

(891, 15)

In [5]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [6]:
#inplace=true modify the data
titanic.dropna(subset=["deck"],axis=0,inplace=True) #remove na vale specifically

In [7]:
#find again null valuses
print(titanic.isnull().sum())
print(titanic.shape)

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64
(203, 15)

In [8]:
#remove na from whole data frame
titanic = titanic.dropna()
titanic.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [9]:
titanic.shape

(182, 15)

In [12]:
#For further analysis we use t1 and t2
t1.shape

(891, 15)

In [13]:
t1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## Replacing missing values with the avg of that col

In [15]:
#finding avg mean value of age col
mean = t1["age"].mean()
mean

29.69911764705882

In [16]:
#replacing nan values with mean of the data as well as update it
t1["age"] = t1["age"].replace(np.nan ,mean)

In [19]:
t1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [20]:
t1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [21]:
#now for deck col
mean = t1["deck"].mean()
mean
#As 'deck' , 'emark_town' and 'embarked' are *Categorical values* , we wont be able to find Mean of the data. 
#To clean the data we have following options.
#It is better to *Drop the 'deck' Column* as it consists of more than 75% of data, so in anyway, 
#this data wont be able to help us in our analysis. 
#If you still dont want to drop the data, you can replace the missing data 
#with Most frequent element of that Descriptive Feature i.e. Mode of the column data.

#For Other 2 Descriptive Features, 'emark_town' and 'embarked' have 2 missing values each,
#so we can easily remove the Respective Rows. Or, we can replace Nan with mode here too.

TypeError: 'Categorical' does not implement reduction 'mean'

## Data Formatting

In [24]:
t1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [28]:
#use this method to conver datatypes from one to another
t1["survived"] = t1["survived"].astype("float64")
t1.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [29]:
#here i'll conver age into days instead of years
t1["age"] = t1["age"]*365
t1["age"]

0       8030.000000
1      13870.000000
2       9490.000000
3      12775.000000
4      12775.000000
           ...
886     9855.000000
887     6935.000000
888    10840.177941
889     9490.000000
890    11680.000000
Name: age, Length: 891, dtype: float64

In [30]:
#now remove zeros so
t1["age"] = t1["age"].astype("int64")
t1["age"]

0       8030
1      13870
2       9490
3      12775
4      12775
       ...
886     9855
887     6935
888    10840
889     9490
890    11680
Name: age, Length: 891, dtype: int64

In [31]:
t1.rename(columns={"age":"age in days"},inplace=True)
t1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3,male,8030,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3,female,9490,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3,male,12775,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
titanic.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3,male,8030,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3,female,9490,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3,male,12775,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [32]:
t3 = titanic[["age in days","fare"]]
t3.head()

   age in days     fare
0         8030   7.2500
1        13870  71.2833
2         9490   7.9250
3        12775  53.1000
4        12775   8.0500

In [35]:
#the above data is  really in wide range and we need to normalize & hard to compare 
#normalization change the value to in range 0-to-1(now both var have similar influence on our models)

## Method of normalization
* simple feature scaling
* x(new) =x(old)/x(max)
* min - max method
* Z-Score(standard score ) -3 to +3
* Log transformation

In [38]:
#simple feature scaling
t3["fare"] = t3["fare"]/t3["fare"].max()
t3["age in days"] = t3["age in days"]/t3["age in days"].max()
t3.head()

C:\Users\MUHAMM~1\AppData\Local\Temp/ipykernel_4200/1081112945.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t3["fare"] = t3["fare"]/t3["fare"].max()
C:\Users\MUHAMM~1\AppData\Local\Temp/ipykernel_4200/1081112945.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t3["age in days"] = t3["age in days"]/t3["age in days"].max()

   age in days      fare
0       0.2750  0.014151
1       0.4750  0.139136
2       0.3250  0.015469
3       0.4375  0.103644
4       0.4375  0.015713

In [40]:
#min-max method
t3["fare"] = t3["fare"]-(t3["fare"].min())/ (t3["fare"].max()-t3["fare"].min())
t3["fare"].head()

C:\Users\MUHAMM~1\AppData\Local\Temp/ipykernel_4200/1569904240.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t3["fare"] = t3["fare"]-(t3["fare"].min())/ (t3["fare"].max()-t3["fare"].min())

0    0.014151
1    0.139136
2    0.015469
3    0.103644
4    0.015713
Name: fare, dtype: float64

In [41]:
#Z-Score(standard score ) -3 to +3
t3["fare"] = (t3["fare"]-t3["fare"].mean())/t3["fare"].std()
t3["fare"].head()

C:\Users\MUHAMM~1\AppData\Local\Temp/ipykernel_4200/2299598999.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t3["fare"] = (t3["fare"]-t3["fare"].mean())/t3["fare"].std()

0   -0.502163
1    0.786404
2   -0.488580
3    0.420494
4   -0.486064
Name: fare, dtype: float64

In [42]:
#log transformation
t3["fare"] = np.log(t3["fare"])
t3["fare"].head()

C:\Users\Muhammad Maaz\anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
C:\Users\MUHAMM~1\AppData\Local\Temp/ipykernel_4200/1530463625.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t3["fare"] = np.log(t3["fare"])

0         NaN
1   -0.240285
2         NaN
3   -0.866325
4         NaN
Name: fare, dtype: float64

In [44]:
ks.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [46]:
ks["fare"] = np.log(ks["fare"])
ks.head()
#aesy krny sy diff same rehta hai lkn readble hojata hai means diff ki range wohi rhygi bas unit ko consise jrdengy

C:\Users\Muhammad Maaz\anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,0.683603,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,1.450832,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,0.727559,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,1.379314,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,0.735091,S,Third,man,True,NaN,Southampton,no,True

## Bining

In [47]:
## converting categories into dummies
# -easy to use for computation
# -Male Female(0,1)

In [48]:
pd.get_dummies(t1["sex"])

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [ ]:
#get_dummies to change data inside a dataframe